In [2]:
# import numpy and pandas
import numpy as np
import pandas as pd

In [3]:
# read a csv file using 'read_csv'
# downloaded mercedesbenz.csv from kaggle

dataFram = pd.read_csv('mercedesbenz.csv')

In [5]:
# Lets see the top 5 records
dataFram.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [6]:
# info() - Summary of dataFrame(like num of rows,col, data types)

dataFram.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [8]:
# describe() - more detailed info like count, mean, sd etc
dataFram.describe() #only integer column will be taken to consideration.Categorical features will be skipped.

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [9]:
# Create a sample csv file with some random integers

testDF = pd.read_csv("Test2.csv",sep=";")

In [11]:
testDF.head()

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [13]:
testDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      object
 1   Column1     5 non-null      int64
 2   Column2     5 non-null      int64
 3   Column3     5 non-null      int64
 4   Column4     5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 328.0+ bytes

In [6]:
# Get category wise unique count
dataFram['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
l      16
aw     16
ad     14
au     11
b      11
k      11
r      10
as     10
bc      6
ao      4
c       3
q       2
aa      2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [12]:
dataFram[dataFram['y']>160] # data frame where y > 100

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
342,681,169.91,aa,l,ak,f,d,i,c,d,...,0,0,0,0,0,0,0,0,0,0
883,1770,265.32,y,r,ai,f,d,ag,l,t,...,0,0,0,0,0,0,0,0,0,0
1203,2396,160.87,j,o,as,f,d,ab,g,p,...,1,0,0,0,0,0,0,0,0,0
1459,2903,167.45,ai,b,ae,a,d,ac,g,m,...,0,0,1,0,0,0,0,0,0,0
3133,6273,165.52,aj,v,r,c,d,q,g,a,...,0,0,1,0,0,0,0,0,0,0

### Create a csv ###

In [13]:
ndata = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,c\n'
        'g,h,n\n')

In [14]:
ndata

'col1,col2,col3\nx,y,1\na,b,c\ng,h,n\n'

In [15]:
type(ndata)

str

In [6]:
# read a str as a csv with the help of StringIO
from io import StringIO
StringIO()

In [17]:
pd.read_csv(StringIO(ndata))

  col1 col2 col3
0    x    y    1
1    a    b    c
2    g    h    n

In [18]:
# useCols - read only specific column values
df1=pd.read_csv(StringIO(ndata),usecols=['col1','col3'])

In [19]:
df1

  col1 col3
0    x    1
1    a    c
2    g    n

In [22]:
# Store newly created data to a csv file
df1.to_csv('Test3.csv')

In [3]:
ndata1 = ('aa,ss,vv,ff\n'
         '2,3,5,6\n'
         '1,3,4,5\n'
         '10,20,12,3')

In [51]:
ndata1

'aa,ss,vv,ff\n2,3,5,6\n1,3,4,5\n10,20,12,3'

In [4]:
print(ndata1)

aa,ss,vv,ff
2,3,5,6
1,3,4,5
10,20,12,3

In [56]:
# Convert column as an object
df2 = pd.read_csv(StringIO(ndata1),dtype=object)

In [57]:
df2

   aa  ss  vv ff
0   2   3   5  6
1   1   3   4  5
2  10  20  12  3

In [58]:
df2['aa']

0     2
1     1
2    10
Name: aa, dtype: object

In [59]:
df3 = pd.read_csv(StringIO(ndata1),dtype=int)

In [60]:
df3

   aa  ss  vv  ff
0   2   3   5   6
1   1   3   4   5
2  10  20  12   3

In [62]:
df3['aa']

0     2
1     1
2    10
Name: aa, dtype: int32

In [63]:
df3['aa'][2]

10

In [64]:
type(df3['aa'][2])

numpy.int32

In [7]:
df4 = pd.read_csv(StringIO(ndata1),dtype=float)

In [8]:
df4

     aa    ss    vv   ff
0   2.0   3.0   5.0  6.0
1   1.0   3.0   4.0  5.0
2  10.0  20.0  12.0  3.0

In [12]:
# mix of different column type
df5 = pd.read_csv(StringIO(ndata1),dtype={'aa':int,'ss':float,'vv':'Int64'})

In [13]:
df5

   aa    ss  vv  ff
0   2   3.0   5   6
1   1   3.0   4   5
2  10  20.0  12   3

In [16]:
type(df5['ss'][1])

numpy.float64

In [10]:
# Understanding index by default index is set as 0
# column will start as 0th index

ndata2 = ('index,a,b,c\n'
         '4,banana,see,2\n'
         '5,kiwi,mik,3')

In [26]:
ndata2

'index,a,b,c\n4,banana,see,2\n5,kiwi,mik,3'

In [27]:
print(ndata2)

index,a,b,c
4,banana,see,2
5,kiwi,mik,3

In [28]:
pd.read_csv(StringIO(ndata2))

   index       a    b  c
0      4  banana  see  2
1      5    kiwi  mik  3

In [32]:
# specify index properly
pd.read_csv(StringIO(ndata2),index_col=0)

            a    b  c
index
4      banana  see  2
5        kiwi  mik  3

In [43]:
# index_col=FALSE
ndata3 = ('a,b,c\n'
         '1,see,mee,\n'
         '2,rr,tt,')

In [41]:
ndata3

'a,b,c\n1,see,mee\n2,rr,tt'

In [45]:
pd.read_csv(StringIO(ndata3))
# The last comma seperation is considered as a 4th item

     a    b   c
1  see  mee NaN
2   rr   tt NaN

In [47]:
# In order to handle such situation we need to specify index_col=False

In [48]:
pd.read_csv(StringIO(ndata3),index_col=False)

   a    b    c
0  1  see  mee
1  2   rr   tt

In [49]:
# usecols & index_col

ndata4 = ('a,b,c\n'
         '4,bee,bat,\n'
         '7,cat,bat,')

In [50]:
ndata4

'a,b,c\n4,bee,bat,\n7,cat,bat,'

In [53]:
pd.read_csv(StringIO(ndata4),usecols=['a','c'])

     a   c
4  bee NaN
7  cat NaN

In [54]:
pd.read_csv(StringIO(ndata4),usecols=['a','c'],index_col=False)

   a    c
0  4  bat
1  7  bat

In [110]:
# Escape characters \\
ndata5 = 'a,b\n"hello,"Shal\\", nice to see you'

In [93]:
ndata5

'a,b\n"hello, \\"Shal\\", nice to see you,5'

In [111]:
pd.read_csv(StringIO(ndata5), escapechar='\\',index_col=False)

             a                 b
0  hello,Shal"   nice to see you

In [112]:
ndata6 = pd.read_csv('tabSeperator.csv')

In [113]:
ndata6

       let\tsee\ttogether\thow
0           it\tworks\tIts\tan
1  amazing\tfeeling\tthats\tit

In [115]:
pd.read_csv('tabSeperator.csv',sep='\t')

       let      see together how
0       it    works      Its  an
1  amazing  feeling    thats  it

In [118]:
pd.read_csv('tabSeperator.csv',sep='\t',index_col=False)

       let      see together how
0       it    works      Its  an
1  amazing  feeling    thats  it

In [119]:
ndata7=pd.read_csv('tabSeperator.csv',sep='\t')
ndata7.head()

       let      see together how
0       it    works      Its  an
1  amazing  feeling    thats  it